using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HomeWork2
{
    class Program
    {
        static void Main(string[] args)
        {
            //Задание 1.Создание нескольких переменных разных типов, в которых могут храниться данные
            //Что нужно сделать
            //Некоторая компания заинтересована в том, чтобы вы создали для неё приложение ― записную книжку. Сейчас в компании работает три сотрудника, именно они и будут пользователями приложения.
            //Создайте переменные для этих пользователей.При этом раскрывать свои персональные данные они не захотели и предпочитают вводить их самостоятельно.
            //Итого для каждого пользователя должны быть доступны переменные под следующие данные:
            //имя, возраст, рост, баллы по русскому языку, баллы по истории, баллы по математике.
            //При решении подумайте, какой тип данных под какую переменную подходит больше всего.

            //char name = new Console.ReadLine();

            //sbyte age = 0;
            //Console.ReadLine(age);


        }
    }
}
